{
  "doc-f40f5bbc1868c84652b31ad5f053cd8f": {
    "content": "Graduate Student Handbook\n2024-2025\n\nTable of Contents\n\nIntroduction\nWelcome to the Software Engineering program within the Department of Systems and Industrial Engineering (SIE) at the University of the Arizona! Founded in 1961 as the nation’s first systems engineering academic program, the SIE department is committed to providing a welcoming learning and research environment and a comprehensive graduate curriculum leading to Master of Science (MS) and Doctor of Philosophy (PhD) degrees. The department offers four MS degrees: Software Engineering, Systems Engineering, Industrial Engineering, and Engineering Management. At the doctoral level, the department offers a research-intensive PhD in Software Engineering and one in Systems and Industrial Engineering.\nThe purpose of this handbook is to serve as a guide for current graduate students on requirements for completing SFWE graduate programs. Additional information is also provided for prospective students to help them to assess opportunities for graduate studies in SFWE.\nSFWE Graduate Studies Administration\nThe following are key contacts of individuals who will support students in their SFWE graduate studies.\n\nGraduate Program Coordinator\n\nThe Graduate Program Coordinator provides administrative and operational support for SFWE Graduate programs, in addition to advising and assisting students with general procedures related to obtaining a SFWE graduate degree.\nDirector of Graduate Studies\n\nThe Director of Graduate studies, also the chair of the SFWE Graduate Studies Committee, appointed by the Department Head, oversees graduate programs in SFWE. The duties of the Director of Graduate Studies include the following, but are not limited to:\nProvide support and necessary resources to ensure professional well-being and success of SFWE graduate students from admission through graduation.\nLead recruitment, admission, and assessment processes for SFWE graduate programs.\nManage day-to-day operations of SFWE graduate programs including review and oversight of plans of study, transfer credits, and other graduate student petitions.\nThe SFWE Graduate Studies Committee, comprised of the Director of Graduate Studies and faculty members appointed by the SIE Department Head, provides overall leadership in administering SFWE graduate programs, in collaboration with the Graduate College at the university-level: grad.arizona.edu.\n\nFaculty Advisor\n\nPhD students and MS students interested in pursuing research are required to identify a research advisor before the end of their first year in the program. Students are encouraged to identify and contact faculty members in their area of interest. At the beginning of each term there will be a Zoom presentation, where faculty will provide a short bio and information on their research. Afterwards, students would need to contact the faculty in the research area of their interest to see if they are a good match. A list of current SFWE faculty, their research areas, and contact information can be found here: SFWE Faculty\n\nOnce the student and a faculty member agree to work together on research, the student should inform the Graduate Program Coordinator of this change.\n\n\nSFWE Graduate Studies Contact Information\nRicardo Valerdi, Director of SIE Graduate Studies \nLiza Soto, Graduate Program Coordinator \nE-mail: sfwe-grad@engr.arizona.edu\n\n1127, E. James E. Rogers Way, Room 111 The University of Arizona\nTucson, AZ – 85721-0020\n\n\nMaster of Science Degrees\nThe MS in Software Engineering is centered around discovery-based education and experiential learning. Students complete design projects and research that emphasize not only development of software engineering solutions, but also, they build experience in communications, teamwork, critical thinking and professionalism. \nMS Degree Requirements\nThe following general degree requirements apply to the SFWE Master of Science.\n\nStudents must earn at least 30 units of graduate credit (courses numbered 5xx, 6xx, 9xx). Credit for SFWE 695A, SFWE 900, and SFWE 920 may not be counted toward the MS degree. No course may be counted toward the requirements for more than two degrees (earned at any institution). For example, an SFWE 5xx course can be counted toward the MS in Software Engineering as well as PhD in SFWE, but it cannot be counted toward a third degree (e.g., MS in another program).\nAll MS students must choose one of the options described below.\n\n\n\nApproved Electives for Software Engineering\n\n\n\n\nMS Plan of Study\nThe Plan of Study is the student's contract with the university regarding specific course requirements that the student must satisfy before becoming eligible for the MS degree. Students should consult with their advisor, Graduate Program Coordinator, and/or the Director of Graduate Studies to identify courses to include in the plan of the study. Students are encouraged to submit a completed plan of study through GradPath before the end of the first year in the program.\nPerformance Requirements: A cumulative GPA of 3.0 or higher must be maintained on all coursework taken for graduate credit. A grade of C or higher is required for a course to be used to satisfy the degree requirements (A or B for transfer credits).\nMS Report vs Thesis Option\nMS Thesis Option: Thesis work is designed for students who wish to work with a faculty member on a specific research topic. The thesis is prepared under the guidance of the faculty advisor and is reviewed by an examining committee prior to an oral presentation. As a part of graduation requirements, the thesis must be submitted to the Graduate College for formatting review and publishing in the campus repository. Students wishing to pursue a Doctoral degree are encouraged to choose the thesis option.\nMS Committee for Thesis Option: Students who pursue the MS thesis option are required to have a committee of at least three faculty members, including the faculty advisor who will serve as the chair of the committee. At least two members must be current Graduate Faculty (i.e., tenured, tenure-track, or approved tenure-equivalent faculty member). If the third member is not a Graduate Faculty, they must be approved by the Graduate College as a special member.\nOnce the committee is formed, the student should submit a Committee Appointment form through GradPath.\nA complete draft of the MS Thesis should be shared with all committee members at least two weeks prior to the anticipated defense date.\nHow to identify committee members? The committee for the MS thesis option will ideally include faculty in the student’s area of interest. The faculty advisor may have suggestions on potential committee members.\n\nAccelerated MS Programs\nThe SFWE Accelerated Master’s Program (AMP) is designed to allow exceptional undergraduate seniors at the University of Arizona to work concurrently toward an MS degree. Up to 12 units of approved graduate coursework taken in their undergraduate career may count towards both BS and MS degrees, allowing students to earn their MS degree quicker.\nWhen can undergraduate students apply to the AMP program? Students interested in the program may apply after completion of a minimum of 75 eligible undergraduate credits. The minimum GPA of 3.3 is required at the time of application as per the Graduate College.\nAMP Admission Requirements\nCumulative GPA at the time of admission is 3.3\nA minimum of 90 undergraduate credit hours is required at the time of entry into the AMP\nCompletion of at least 12 earned undergraduate credits in the SFWE major at the University of Arizona (SFEBSSFE). Units still graded Incomplete, units graded Pass/Fail or units taken as audit will not count toward the requirement of the 12 undergraduate units\nAdditional application materials: One letter of recommendation and a statement of purpose. GRE is not required for AMP admission.\nAcademic Policies related to the AMP\nOnce students are admitted to the AMP, they are strongly encouraged to see the SFWE Graduate Program Coordinator and the SFWE Undergraduate Advisor to discuss their plan of study. Students pursuing MS thesis or report plan must select a faculty advisor and submit a preliminary thesis/report proposal and plan of study before the end of the first semester after being admitted to the AMP.\nAMP academic policies and tuition policies are defined by the Graduate College and are described in the General Catalog at https://catalog.arizona.edu/policy/accelerated-masters-program-amp#policies.\n\n\nSFWE Doctor of Philosophy\nThe Software Engineering Doctor of Philosophy Program (PhD) is designed for individuals wishing to pursue advanced research and scholarly work.\nDoctoral Coursework and Plan of Study\nThe Plan of Study is the student's contract with the university regarding specific course requirements that the student must satisfy before becoming eligible for the PhD degree. This includes a minimum of 48 units of non-dissertation course work (of which 12 units will be applied to the minor), plus at least 18 units of dissertation research and two units of Graduate Colloquium. \n\n\n\nPerformance Requirements: A cumulative GPA of 3.0 or higher must be maintained on all coursework taken for graduate credit. A grade of C or higher is required for a course to be used to satisfy the degree requirements (A or B for transfer credits). Doctoral students are also required to actively participate in and contribute to research activities with mentorship from their faculty advisor. \nCan graduate coursework from a master’s degree be applied toward the PhD degree? With approval from the student’s faculty advisor, graduate coursework applied toward a master’s degree may be applied toward the PhD. Non-coursework credits (e.g., thesis or research credits) from a master's degree cannot be applied toward the PhD degree. Transfer credits are subject to the following restrictions:\nA maximum of 30 units of relevant coursework from another graduate degree may be transferred and applied toward the PhD requirements.\nThe credits must first be reviewed and approved by the student’s faculty advisor.\nThe minimum grade for transferred credits must be an A, B, or the equivalent at the institution where courses were taken.\nParticipation in SFWE Graduate Seminar/Colloquium: Students must take at least two units of SFWE 695A Graduate Seminar. This class will be graded as Pass/Fail. To fulfill this requirement, students must attend the department seminars during each semester where they are enrolled in SFWE 695A. Prior to completing the seminar requirement, the student must also give a research presentation to the class. After completing the seminar requirement, students are highly encouraged to continue attending graduate seminars of interest to their research area.\nAre independent study credits (e.g., SFWE 699) applicable to PhD coursework? Three units of independent investigation may be included in the plan of study, provided the independent study covers a topic not available through regular courses and a detailed course plan is submitted to and approved by the Graduate Studies Committee\nAre SFWE 900 credits applicable to PhD coursework or dissertation research? SFWE 900 research credits may not be counted toward the PhD Degree.\nMinimum registration requirement for funded students: Students funded by the SIE Department are required to be enrolled in at least nine graduate units per semester to maintain their appointment.\n\nDoctoral Minor\nFor SFWE PhD Students: Doctoral students in SFWE are required to choose a minor and minor advisor outside of SFWE and complete 12 units of graduate coursework in the minor department/program. Common minor programs for SFWE students are systems & industrial engineering, computer science, information science, statistics, and other engineering programs (e.g., biomedical, computer, or mechanical engineering). Students can also choose to do a split minor between two programs (6 units in each minor program) or a multidisciplinary minor. The minor advisor typically serves on the student’s comprehensive exam committee. Their participation in the final dissertation committee is at the discretion of the student’s major advisor.\nFor non-SFWE PhD Students: Doctoral students in any department/program outside of SFWE may choose to minor in SFWE. Students intending to minor in SFWE should first identify a SFWE faculty as their minor advisor. \nThe PhD minor in SFWE consists of 12 units of graduate coursework.\n6 units from Core Area Courses\nSFWE 507 – Foundations of Software Engineering\nSFWE 502 – Software DevSecOps\nSFWE 503 – Software Project Management \nSFWE 504 –  Software Requirements Analysis & Testing\nSFWE 505 – Software Architecture & Design\nSFWE 506 – Distributed Computing\n6 units from SFWE-approved electives\nSFWE 501 – Software Assurance\nSFWE 508 – Data Mining\nSFWE 509 – Cloud Computing Principles and Practices\nSFWE 510 – Cloud Native Software Engineering\nSFWE 511 – Software for Industrial Control Systems\nSFWE 512 – Robotics\nSFWE 513 – Software Engineering Research Methods\n A minor that is split between SFWE and another academic department/program requires 6 units of graduate coursework from the SFWE core area courses and 6 units of coursework in the other program. Participation of the SFWE minor advisor in written and oral comprehensive exam and final defense is at discretion of the minor and major advisors.\nDoctoral Qualifying Exam (QE)\nPurpose: The Doctoral Qualifying Examination (QE) aims to evaluate the prerequisite knowledge required to undertake research in the student’s area of interest in Software Engineering, leading to successful completion of the Ph.D.\nThe QE is required to be taken by the student prior to the end of their third semester, and will be administered by a Qualifying Exam Committee (QEC) comprising of at least three and not more than five members of College of Engineering faculty. The QEC will be chaired by the student’s Faculty Advisor, who will work with the student in identifying the rest of the QEC. The content of the QE will be based on graduate level courses in software engineering and related disciplines based on each individual student’s plan of study.\nThe content of each doctoral student’s QEC will be submitted by their advisor for approval by the Director of SFWE Graduate Studies Committee one month prior to scheduling the exam. Once the QEC is approved, the student should schedule this QE at a suitable time for the Committee with the assistance of the Graduate Program Coordinator. The student is allowed to request meetings with the QEC members in advance to discuss the scope of the exam, and the appropriate review topics.\nThe QE will be a closed session (not open to public) exam administered by the QEC through a combination of oral/written questions on topics priorly identified to the student. The exam is required to be at least forty-five minutes in duration and cannot last more than three hours. \nEvaluation: At the end of the exam, the committee will vote if the student passed or failed in a secret ballot administered by the chair of the QEC. The majority of the QEC voting a fail vote will result in failure in the exam, wherein abstaining to vote equates to a Negative vote. The results of the exam will be provided by the QEC chair to the SFWE Graduate Studies Committee.\nStudents failing the QE the first time are allowed a second and last attempt in the following semester. The QEC for the second attempt can request access to the results of the first QE and is required to have at least one member from the first QEC. can retake the exam for the second time.\nFailure to pass the QE on the second attempt will result in the removal of the student from the SFWE PhD program.\nDoctoral Comprehensive Exam\nPurpose: The purpose of the comprehensive examination is to determine whether the student has developed sufficient background and expertise for research in the field of their planned dissertation. Successful completion of the examination leads to formal admission to PhD candidacy.\nFormat: This exam includes written and oral portions covering the major and minor areas of the student. Shortly after successful completion of the written portion, an oral exam is conducted by a committee appointed by the Dean of the Graduate College in consultation with the department.\nWritten Comprehensive Exam: The student will send a summary of the dissertation proposal to the committee when they are ready for taking the comprehensive exam. Each committee member will then develop a set of questions related to the student’s area of specialization and, when appropriate, on any aspect of the student’s proposed dissertation. The nature and type of questions as well as the timeline for the student to respond to the questions (e.g., few weeks to a month) are up to each committee member.\n\nOral Comprehensive Exam: After completing all written portions, the student can schedule an oral exam with the committee. The oral exam typically includes a presentation based on the proposed dissertation research.\nTiming: The comprehensive exam is typically taken at least a semester to a year before the final dissertation defense. It is recommended that the comprehensive exam is taken at least nine months before the final defense.\nEvaluation: Students are evaluated on their ability to formulate and analyze research problems using theory and methods from their major and minor areas of specialization as well as their written and oral communication.\nFor the written comprehensive exam, each committee member will assess the outcome as pass or fail. A committee member may ask for clarifications or revisions to the written exam once. Satisfactory response to all questions from each committee member constitutes a pass in the written exam.\nFor oral comprehensive exam, each committee member will assess three areas (extent of pertinent literature review and analyses; depth and originality of research problem and methods; communication) on a scale of 1 to 5. A score of 3 or above on all three areas from all committee members is considered as pass. When the student passes the oral comprehensive exam, they are recommended to the Graduate College for acceptance as a PhD candidate. At the discretion of the committee, the student may repeat the oral comprehensive exam once within four months, incorporating specific recommendations from committee members.\nComprehensive Exam Committee: The committee must consist of a minimum of four members, of which one member must be a minor representative. Three members, including their major and minor advisors, must be current tenured, or tenure track faculty members or approved tenure equivalent. The fourth member may be an approved special member. The minor faculty advisor may choose to waive the written portion of the exam but is required to participate in the oral comprehensive exam.\nDoctoral Final Exam: Written Dissertation and Final Oral Defense Exam\nPurpose: The purpose the doctoral final exam is to assess the merit and contributions of the candidate’s doctoral research. This doctoral final exam is a culmination of the candidate’s original research conducted during their PhD program.\nFormat: There are two components to the doctoral final exam: a written dissertation and a final oral defense of their dissertation.\nWritten Dissertation: The candidate should develop a written document that demonstrates all aspects of their research including significance of the work, a detailed review of relevant literature, methodologies employed and/or developed, significant findings from the work, a critical discussion of the findings, limitations, and the impact, and potential for future research. The specific format of written dissertation is defined by the faculty advisor. General formatting guidelines are provided by\n\nthe Graduate College: https://grad.arizona.edu/gsas/dissertations-theses/dissertation-and-thesis- formatting-guides\nFinal Oral Defense: When the doctoral candidate has met the rigor and standards of scholarship and has documented the research in a dissertation, the candidate will publicly defend the dissertation and answer any general questions related to their work. The exact time and place of the oral defense must be announced publicly at least two weeks in advance of the oral defense. The oral defense is facilitated by a faculty committee appointed by the Dean of the Graduate College in consultation with the major department and chaired by the faculty advisor. The presentation portion of the oral defense is open to the public. Following the public presentation and discussion, the candidate will participate in a closed meeting with the committee for further evaluation.\nTiming: The oral defense can be scheduled when both the candidate and faculty advisor agree that the proposed dissertation research is complete, rigorous, and of high quality. The written dissertation should be complete at the time of scheduling the oral defense. An electronic version of the dissertation should be shared with all committee members at least two weeks prior to the oral defense date. Additionally, an Announcement of Oral Examination Form should be completed and submitted via GradPath at least two weeks (i.e., 10 business days) prior to the oral defense date.\nEvaluation: The dissertation committee will assess the originality, merit, and contributions of the candidate’s research. This includes their ability to (a) identify and critically evaluate relevant literature,\n(b) formulate and solve original problems using SFWE methods, and (c) interpret and communicate research ideas and findings. Further guidelines for the oral defense are provided by the Graduate College: https://arizona.app.box.com/v/grad-gsas-finaldefnsinstr\n\nDissertation Committee: The committee must consist of a minimum of three faculty members, all of whom must be current University of Arizona faculty members that are either tenured, tenure-track, or approved as tenure equivalent. Fourth and any additional committee members can be tenured or tenure- track or approved special members. All dissertation committee members are expected to attend the entire final defense.\n\nResources and Academic Policies for SIE Graduate Students\nGrievance Procedures\nA graduate student with any type of grievance should first communicate with their faculty advisor or Director of SFWE Graduate Studies, depending on who is more appropriate from the student’s view. Should the issue not be properly addressed by either faculty members, the student may bring the matter to the attention of the Graduate Program Coordinator and the SIE Department head.\nWhen issues cannot be resolved at the department-level, the student is encouraged to review the Graduate College grievance policy; https://grad.arizona.edu/policies/academic-policies/grievance-policy\nSummary of Grievance Types and Responsibilities is here: https://grad.arizona.edu/policies/academic- policies/summary-grievance-types-and-responsible-parties\n\nIf a student believes they have been subject to discrimination or harassment based on race, religion, color, sex, age, national origin, disability, veteran status, sexual orientation, gender identity or genetic information, they can report such issues to the Office of Institutional Equity: https://equity.arizona.edu/\n\nSatisfactory Academic Progress\nGraduate students are required to maintain a minimum 3.00 cumulative GPA. Students should consult with both their faculty advisor and Graduate Program Coordinator to discuss issues pertaining to unsatisfactory progress that may result in academic probation: https://grad.arizona.edu/policies/academic- policies/academic-probation.\nStudents who fail to meet the GPA requirement will be placed on academic probation for one semester. Students on academic probation, under the advisement of their faculty advisor, will meet to develop a mentoring plan to raise the cumulative GPA. If after one semester the cumulative GPA has not been raised, the graduate studies committee will decide whether to: (1) academically disqualify the student from the program; or (2) with approval from the Graduate College, allow the student to continue probation upon approval of a justification waiver. The student is expected to continue working with their faculty advisor and Graduate Program Coordinator to improve their academic standing. Students who fail to make satisfactory progress for two consecutive semesters will be dismissed from their program.\nIncomplete Grades\nStudents earning a grade of Incomplete, “I” are encouraged to submit a completed Report of Incomplete form to the Graduate Student Coordinator: https://registrar.arizona.edu/faculty-staff- resources/grading/grading-policies/incomplete\nIncomplete grades should be completed in a timely manner and are submitted at the discretion of the course instructor. Per the Graduate College, any incomplete grade must be completed no later than one year from the last day of the term for the course for which the student received the incomplete: https://catalog.arizona.edu/policy/grades-and-grading-system#incomplete\nIf an additional extension is needed, the student may submit a Graduate Course Extension Petition to be reviewed by the Graduate College prior to the one-year deadline.\nGraduate Student Academic Services\nThe graduate student academic services (GSAS) within the graduate college help students, staff, and faculty advisors keep track of academic progress and the steps needed to complete a graduate degree: https://grad.arizona.edu/gsas\n\n\n\nResources for Healthy and Productive Graduate Student Life\nThe following are curated set of resources* for healthy, happy, and productive graduate student life at the University of Arizona.\nProfessional Development resources including writing resources, teaching workshops and seminars, and resources for expanding language abilities: https://gradcenter.arizona.edu/resources\nGraduate Assistant/Associate Benefits including parental leave, family and medical leave, bookstore discount, and health insurance: https://grad.arizona.edu/funding/ga/benefits-appointment\nHealth and well-being: List of comprehensive services and support for physical, mental, emotional well-being for graduate students: https://www.arizona.edu/health-wellness-students\nChild and Elder Care: https://lifework.arizona.edu/\nSafety: Link to sign-up for campus emergency alerts - https://cirt.arizona.edu/ualert\nStudent Support Groups and Organizations:\nGraduate Student Professional Council: https://gpsc.arizona.edu/\nOffice of Fellowships and Community Engagement: https://gradcenter.arizona.edu/gcof/\nSIE-specific organizations: https://sie.engineering.arizona.edu/undergrad-programs/student-clubs\n\n\nFinancial Assistance\nGraduate Teaching and Research Assistantships\nFinancial assistance is available through the SIE Department in limited amounts, in the form of Graduate Teaching Assistantships (GTA) and Graduate Research Assistantships (GRA). Online students are generally not eligible for these assistantships.\nTeaching Assistantships: GTAs are allocated on a competitive basis, with priority given to incoming students who exhibit outstanding potential and to continuing students who are making satisfactory progress toward their graduate degree. GTAs are normally provided for a maximum of three semesters for a student in an MS degree program, or for a total of six semesters for a student pursuing a PhD.\nResearch Assistantships: A limited number of GRAs are available for students who are exceptionally well-prepared to aid faculty research activities. Funding decisions on GRAs rest\n\ndirectly with those faculty members with grant funding. Interested students should discuss the availability and requirements for GRA funding with their faculty advisor.\nMinimum registration requirement for funded students: Students funded by the SIE Department are required to be enrolled in at least nine graduate units every semester to maintain their appointment.\nTuition Scholarships\n\nEach semester the SIE Department awards a limited number of tuition scholarships, which provides partial tuition waivers for graduate students. To be eligible, a student must be enrolled for nine or more graduate units and be in good academic standing.\nGraduate Fellowships\n\nSFWE graduate students are actively considered for fellowships at the department, college, and University levels, as well as external fellowship opportunities.\nCollege Fellowships: The College of Engineering offers a range of graduate fellowships to highly qualified MS and PhD students. The SFWE Graduate Studies Committee nominates current and incoming graduate students for college fellowships on a regular basis as opportunities arise.\nUniversity Fellowship Program: As the flagship initiative of the Graduate College, the University Fellows program is offered to highest-ranked incoming doctoral students. Every year, the SFWE Graduate Studies Committee nominates two incoming doctoral students. More information on this program can be found here: https://gradcenter.arizona.edu/university-fellows-program.\nFunding and Financial Information from the Graduate College: https://grad.arizona.edu/funding\n\nInformation for Prospective Graduate Students\nGraduate Admissions\nFor regular admissions, applicants should have a bachelor’s degree in software engineering, computer science, or a computing related field. Application for admission is made by applying through GradApp: https://apply.grad.arizona.edu/users/login. All applications require academic transcripts, a statement of purpose describing their intent and motivation to pursue a graduate degree in SFWE, three letters of recommendation, and a resume or curriculum vitae. Application deadlines and other admission details are available at https://sfwe.engineering.arizona.edu/grad-programs/admissions\n\nMinimum Admission Requirements\nApplicants interested in pursuing a SFWE graduate degree must meet the following minimum requirements:\nA minimum 3.0 cumulative GPA in their overall undergraduate degree or in the last 60 units of their undergraduate degree.\nHold a BS degree from a regionally accredited USA university or equivalent international university recognized by the UArizona.\nAdditionally students must have\nProficiency in at least 1 programming language\nOR 1-2 years of industry experience in a software-development position\nStudents with BS Degree outside of Software Engineering\n\nStudents with BS degrees in disciplines not directly related to Software Engineering may be admitted into the MS or PhD program. However, those students may be required to complete a certain number of undergraduate deficiency courses prior to enrolling in graduate courses for SFWE. \nIs an MS degree required for applying to the SFWE PhD program? The SFWE doctoral program does not require applicants to have an MS degree to be admitted. Admitted PhD students have the option to earn a SFWE MS degree enroute to their PhD. Students interested in this option should contact the Graduate Program Coordinator during their second year in the program.\nFor all other questions, please visit https://sfwe.engineering.arizona.edu/grad-programs/admissions or e- mail sfwe-grad@engr.arizona.edu."
  },
  "doc-39eb78868e5aa92458a418887748fd81": {
    "content": "UNDERGRADUATE\nSTUDENT\nHANDBOOK\n2023-2024\n\n\fTable of Contents\n1. Introduction .............................................................................................................................................................1\n2. SIE Undergraduate Studies Administration .......................................................................................................2\nMajor Academic Advisor ..................................................................................................................................2\nDirector of BS Programs ....................................................................................................................................3\nFaculty Advisor .................................................................................................................................................. 3\n3. BS Degree Requirements .......................................................................................................................................3\n4. Accelerated MS Programs .....................................................................................................................................5\n5. Resources and Academic Policies for SIE Undergraduate Students ............................................................... 6\nRequesting Documents......................................................................................................................................6\nENGR 102: Introduction to Engineering .........................................................................................................6\nTransfer Credit and Articulation .....................................................................................................................6\nSIE 493: Internship .............................................................................................................................................6\nHonors College ...................................................................................................................................................6\nGrievance Procedures ........................................................................................................................................7\nInternational Student Services (ISS) advisor and MyGlobal ........................................................................ 7\n6. Satisfactory Academic Progress ............................................................................................................................ 7\n7. Resources for Healthy and Student Life .............................................................................................................. 8\n8. Scholarships .............................................................................................................................................................9\n\n1. Introduction\nWelcome to the Department of Systems and Industrial Engineering (SIE) at the University of the Arizona!\nFounded in 1961 as the nation’s first systems engineering academic program, the SIE department is\ncommitted to providing a welcoming learning and research environment and a comprehensive\nundergraduate curriculum leading to bachelor of science degrees in systems engineering, industrial\nengineering, and engineering management. The Bachelor of Science in Systems Engineering program,\nBachelor of Science in Industrial Engineering program, and Bachelor of Science in Engineering\nManagement program are accredited by the Engineering Accreditation Commission of ABET,\nwww.abet.org. The department offers three MS degrees: Systems Engineering, Industrial Engineering, and\nEngineering Management. At the doctoral level, the department offers a research-intensive PhD in Systems\nand Industrial Engineering.\nThe purpose of this handbook is to serve as a guide for current undergraduate students on requirements\nfor completing SIE undergraduate programs.\n\n1\n\n\f2. SIE Undergraduate Studies Administration\nThe following are key contacts of individuals who will support students in their SIE undergraduate studies.\n\nMajor Academic Advisor\nEmail correspondence can be sent to advisor@sie.arizona.edu. Students are responsible for checking their\nCatmail daily for important updates, announcements, deadlines, and opportunities. This can\nbe supplemented by joining UArizonaSIE Discord server and following our SIE Instagram and\nLinkedIn. During fall/spring semesters, newsletters will be sent at least 1-2 times with any other\nnecessary emails in between.\nAcademic Advising is a collaborative relationship between the student and academic advisor. The intent\nof the collaboration is to assist the student in developing educational and career goals. Academic advisors\nassist and support the student in progressing toward the appropriate degree. Academic advisors provide\nacademic assistance and individualized attention to promote each student's success at the University of\nArizona. An academic advisor can share knowledge, experience and insight that is beneficial to the student.\nThe advisor's role is to help the student evaluate and realize educational and career options. This requires\nthe advisor to:\n•\n•\n•\n•\n•\n•\n\napprove the student's academic program of study\nprovide accurate and consistent information\nclarify program requirements, policies and procedures\nassist the student in identifying appropriate institutional resources\nfacilitate relationships between the student and other individuals on campus who may provide\nassistance\nuphold the academic standards of the institution\n\nA key tenet of academic advising is that the student is responsible for his or her own decisions. Academic\nadvisors exist because students require information and assistance to navigate the university system and\nto make appropriate decisions. The student's role is to explore academic, career and personal goals. This\nrequires the student to:\n• seek advising from appropriate advisors at appropriate times\n• learn academic program requirements\n• utilize available resources, including those that are web-based, to monitor academic progress\n• take responsibility for actions and decisions that affect academic progress\n• be engaged\nRequired Meetings with Major Academic Advisor:\nStudents can schedule Zoom or in-person advising appointments through Trellis Advise,\nUAccess>Advising>Trellis Advise. The meetings listed here are required:\n• Once admitted into SIE major to remove advising hold in UAccess\n• Semester before enrollment in upper division courses/applying for advanced standing\n• Semester before you are ready to graduate to complete your final degree audit\n• Each semester prior to Priority Registration (strongly recommended)\n\n2\n\n\fDirector of BS Programs\nDirector, Industrial Engineering, Dr. Pavlo Krokhmal (email: krokhmal@arizona.edu)\nDirector, Systems Engineering, Dr. Alejandro Salado (email: alejandrosalado@arizona.edu)\nDirector, Engineering Management, Dr. Michael Kwinn (email: kwinnm@arizona.edu)\nDirector of Undergraduate Studies, Dr. Jianqiang Cheng (email: jqcheng@arizona.edu)\n\nFaculty Advisor\nUpon arriving at the University of Arizona, students are assigned a faculty advisor based on their major.\nYour faculty advisor is there to offer you their perspective and expertise regarding careers, graduate school,\nresearch, and approval of directed research or internships. A list of current SIE faculty, their research areas,\nand contact information can be found here: https://sie.engineering.arizona.edu/faculty-staff/faculty.\n\n3. BS Degree Requirements\nSIE programs offer unique combinations of technical knowledge, communication skills, teamwork and\nleadership experience. SIE programs focus on the skills needed in every industry to design and refine\ncomplex systems and to prepare individuals for professional work in systems, industrial, and engineering\nmanagement.\nThe following general degree requirement applies to undergraduate programs in systems engineering,\nindustrial engineering, and engineering management. It is the student’s responsibility to review their\nAdvisement Report in UAccess with their academic advisor to ensure satisfaction of graduation\nrequirements.\n•\n\nStudents must earn a minimum of 128 credits for degree. Minimum 64 credits must be acquired\nat UA for transfer students.\n\n•\n\nThe advised sequence of courses serves as a guide and is available for all engineering majors.\n\n•\n\nThe majority of course work must be taken within the SIE Department, unless instructor approval is\nacquired for an SIE equivalent course.\n\n•\n\nMid-Career Writing Assessment (MCWA): Every undergraduate degree requires satisfaction. Based\non performance in ENGL 102, or ENGL 108, or ENGL 109H. Students earning less than a B grade will\nneed a B grade or higher in required technical writing course.\n\n•\n\nAdvanced Standing: This indicates that students are ready to enroll into junior/senior level engineering\ncourses by completing lower division courses and meeting GPA requirements. Eligible students must\nmeet with their major academic advisor to apply.\n\n•\n\nEngineering Minor and Technical Elective Requirements: In addition to core courses and prerequisites,\nsystems engineering and engineering management students complete an engineering or thematic\nminor, consisting of 18 unique units of primarily technical electives. Industrial engineering students\ndo not have a minor requirement but must complete 12 units of technical electives from upper-division\ncoursework. The SIE department has prepared the guidelines for required minors and technical\nelectives and double-dipping policy:\no\n\nMinor Course Guide for Systems Engineering\n\no\n\nMinor Course Guide for Engineering Management\n\no\n\nTechnical Elective Guide for Industrial Engineering\n\n3\n\n\fThematic minors will need form/course approval from major faculty advisor. Students must declare\ntheir engineering minor here: https://engr.arizona.edu/academic-policies/declare-minor\nStudents are able to use either SIE 492, Directed Research or SIE 493, or Internship credit towards their\nSIE minor or technical elective, after major faculty advisor approval.\n•\n\nSenior Capstone Requirements (ENGR 498A/B) - now offered both fall and spring semesters. Must\nbe UA seniors with advanced standing, met GPA and prerequisite/corequisite major requirements\nin order to enroll. Students cannot have any lower division deficiencies or incomplete grades. Fall\nENGR 498A enrollment is for students with expected graduation in spring semester. Spring ENGR\n498A enrollment is for students with expected graduation in fall semester.\n\nStudents need to work with their academic advisor regarding their study plan to ensure they are\nprepared by having met the requirements for this interdisciplinary capstone.\nSystems Engineering Majors: Prerequisites: SIE 370, SIE 454A. Co-Requisites: SIE 410A, SIE 330R\nEngineering Management Majors: Prerequisites: SIE 457. Co-Requisite: SIE 406\nIndustrial Engineering Majors: Prerequisites: SIE 370, 383. Co-Requisites: SIE 410A, SIE 330R\nSIE Undergraduate Degree Options\nDegree\n\nRequirements\n\nMin. Units\n\nSystems\n\n•\n\nEarn C grades or higher in all 200-level SIE courses\n\nEngineering\n\n•\n\nRequire completion of lower division courses to be eligible to\n\n128\n\napply advanced standing\n•\n•\n\nMaintain minimum 2.0 cum/major GPA\nEngineering minor required, no double-dipping between\nmajor and minor courses, 2.0 minor GPA\n\nIndustrial\n\n•\n\nEarn C grades or higher in all 200-level SIE courses\n\nEngineering\n\n•\n\nRequire completion of lower division courses to be eligible to\n\n128\n\napply advanced standing\n\nEngineering\n\n•\n\nMaintain minimum 2.0 cum/major GPA\n\n•\n\nUpper division technical electives- 12 units\n\n•\n\nRequire completion of lower division courses to be eligible to\n\nManagement\n\napply advanced standing\n•\n\nMaintain minimum 2.0 cum/major GPA\n\n•\n\nEngineering minor required, no double-dipping allowed\nbetween major and minor courses, 2.0 minor GPA\n\n4\n\n128\n\n\f4. Accelerated MS Programs\nThe SIE Accelerated Master’s Program (AMP) is designed to allow exceptional undergraduate seniors at\nthe University of Arizona to work concurrently toward an MS degree. Up to 12 units of approved graduate\ncoursework taken in their undergraduate career may count towards both BS and MS degrees, allowing\nstudents to earn their MS degree quicker.\nWhen can undergraduate students apply to the AMP program? Students interested in the program may\napply after completion of a minimum of 75 eligible undergraduate credits. The minimum GPA of 3.3 is\nrequired at the time of application as per the Graduate College.\nAMP Admission Requirements:\n•\n\nCumulative GPA at the time of admission is 3.3\n\n•\n\nA minimum of 90 undergraduate credit hours is required at the time of entry into the AMP\n\n•\n\nCompletion of at least 12 earned undergraduate credits in their SIE major at the University of Arizona.\nUnits still graded Incomplete, units graded Pass/Fail or units taken as audit will not count toward the\nrequirement of the 12 undergraduate units\n\n•\n\nStudents should have taken the following MS prerequisite courses. Courses equivalent to these\nprerequisites taken at other departments or institutions will be allowed.\no\n\nSIE 305: Introduction to Probability and Statistics\n\no\n\nSIE 340: Deterministic Operations Research\n\no\n•\n\nSIE 321: Probabilistic Models in Operations Research (optional for MS in EMG students)\n\nAdditional application materials: Three letters of recommendation, a statement of purpose and a\nCV/Resume. GRE is not required for AMP admission.\n\nAcademic Policies related to the AMP:\n•\n\nOnce students are admitted to the AMP, they are strongly encouraged to see the Graduate Program\nCoordinator and the SIE Undergraduate Advisor to discuss their plan of study. Students pursuing MS\nthesis or report plan must select a faculty advisor and submit a preliminary thesis/report proposal and\nplan of study before the end of the first semester after being admitted to the AMP.\n\n•\n\nSIE 500 level courses that are convened with 400 level courses and their 400 level courses are required\nfor a BS degree cannot be counted toward an MS degree. For example, if a student is enrolled in the BS\nin Industrial Engineering (INE) program, SIE 531 cannot be counted toward the student’s MS INE\ndegree as SIE 431 is required for the BS INE program. However, if a student is enrolled in the BS in\nSystems Engineering (SYE) program, SIE 530 can be counted toward both the BS SYE and MS SYE as\nSIE 430 is not required for the BS SYE.\nAMP academic policies and tuition policies are defined by the Graduate College and are described in\nthe General Catalog at https://catalog.arizona.edu/policy/accelerated-masters-program-amp#policies.\n\nPerformance Requirements: A cumulative GPA of 3.0 or higher must be maintained on all coursework\ntaken for graduate credit. A grade of C or higher is required for a course to be used to satisfy the degree\nrequirements (A or B for transfer credits).\n\n5\n\n\f5. Resources and Academic Policies for SIE Undergraduate Students\nRequesting Documents\nROTC study plans, sponsor letters, sponsor study plans, and other documents:\nIt is the student’s responsibility to give academic advisor advance notice when requesting creation of a\nstudy plan or specific sponsor letter not offered by ISS, My Global. A minimum of 5-7 business days (M-F)\nturnaround or more are needed if requested during peak advising periods.\n\nENGR 102: Introduction to Engineering\nStudents who did not begin as a first-year student in the College of Engineering and who do not have\nadvanced past the introductory state of an engineering curriculum and will not be able to enroll into ENGR\n102. Work with your major advisor for an approved course substitution to satisfy your graduation\nrequirements.\n\nTransfer Credit and Articulation\nThe Transfer Credit Guide will list courses that have already been evaluated for direct equivalency. A\ncourse equivalency request must be submitted to the appropriate department if the transfer course has not\nbeen evaluated, in which a syllabus is required. If the transfer coursework is an engineering course, the\nsyllabus will have to be sent to the specific engineering department for evaluation. If planning on taking a\nlower division course within Arizona, then check AZTransfer to confirm course equivalency prior to\nenrollment.\n\nSIE 493: Internship\nJuniors and seniors who intern with private or public employers outside the University to work on\nsubstantially technical projects related to their academic work are eligible for internship credits through\nSIE 493 (Internship). A maximum of 3 units of SIE 493 may be applied toward 1) technical elective\nrequirements in curricula leading to a Bachelor of Science (BS) in Industrial Engineering, 2) thematic minor\nor industrial engineering/engineering management minor requirements in curricula leading to a BS in\nSystems Engineering, or 3) thematic minor or industrial engineering/systems engineering requirements in\ncurricula leading to a BS in Engineering Management. See here for more details on the guidelines:\nhttps://sie.engineering.arizona.edu/sites/sie.engineering.arizona.edu/files/syllabus/SIE493-InternshipGuidelines.pdf\n\nHonors College\nStudents in the Honors College are only required to complete 23 honors units for engineering students. The\nCollege’s senior capstone, ENGR 498A/498B are included as part of the 30 required honors units. SIE has\nthree courses that offer honors sections (002): SIE 265 (fall/spring), SIE 340 (fall), and SIE 432 (summer).\nHonors students should meet with their Honors advisor regarding honors-specific questions.\n\n6\n\n\fGrievance Procedures\nA student with any type of grievance should first communicate with their faculty, then academic advisor.\nShould the issue not be properly addressed by faculty, the student may bring the matter to the attention of\nthe SIE Department head.\nIf a student believes they have been subject to discrimination or harassment based on race, religion, color,\nsex, age, national origin, disability, veteran status, sexual orientation, gender identity or genetic\ninformation, they can report such issues to the Office of Institutional Equity: https://equity.arizona.edu/\n\nInternational Student Services (ISS) advisor and MyGlobal\nInternational student advisors are available on Zoom for quick advising or through scheduled\nappointments. ISS advisors can answer questions related to academic changes, work authorizations,\nchange of status to F-1, full-time enrollment requirements, leave of absence, travel and reentry, cultural,\nsocial, and academic adjustment. The ISS advisors can also answer questions related to immigration,\norientation, financial guarantees, letter requests, concurrent enrollment, enrollment verification, and\nsponsorship requirements.\n\n6. Satisfactory Academic Progress\nUndergraduate students are required to maintain a minimum 2.00 cumulative/major/minor GPA and make\nsatisfactory academic progress in degree requirements. Students should consult with their SIE academic\nadvisor to discuss issues pertaining to unsatisfactory progress that may result in academic probation.\nGrade Replacement Opportunity (GRO): offers students the ability to replace grades of C or lower by\nrepeating the course and filing a GRO in UAccess by the deadline. GRO’s may be used for a maximum\nof 3 courses.\nUniversity Repeat Policy: Students may attempt the same course at the University no more than twice.\nStudents who fail to meet the GPA requirement will be placed on academic probation for one semester.\nStudents on academic probation, under the advisement of their major advisor, will meet to develop a\nsuccess plan to raise the semester/major/cumulative GPA. If after one semester the GPA has not been raised,\nthe College can move a student out of the College to the A-Center.\nIncomplete Grades:\nThe grade of “I” may be awarded only at the end of a term, when all but a minor portion of the coursework\nhas been satisfactorily completed. It is not to be awarded in place of a failing grade.\nStudents earning a grade of Incomplete, “I”, will work with instructor to complete a required Report of\nIncomplete form: https://registrar.arizona.edu/faculty-staff-resources/grading/grading-policies/incomplete\nIncomplete grades should be completed in a timely manner and are submitted at the discretion of the\ncourse instructor. Any incomplete grade must be completed no later than one year from the last day of the\nterm for the course for which the student received the incomplete or will receive an “E,” failing grade.\n\n7\n\n\fLinks to Undergraduate College Resources\nFour-Year Plans: advised sequence of courses based on\n\nhttps://engr.arizona.edu/current/4-year-\n\nyear you started at University of Arizona\n\ndegree\n\nOverview of Degree Requirements: In addition to SIE\ndegree requirements, students must meet university\nrequirements described in the link on the right.\n\nhttps://catalog.arizona.edu/undergraduateprograms\n\nImportant dates and deadlines related to undergraduate\n\nhttps://www.registrar.arizona.edu/dates-\n\ndegree: It is student’s responsibility to check deadlines.\n\nand-deadlines\n\nConvocation & Commencement Information\n\nhttps://commencement.arizona.edu/\n\nStudent Forms\n\nhttps://registrar.arizona.edu/student-forms\n\n7. Resources for Healthy and Student Life\nThe following are curated set of resources for healthy, happy, and productive student life at the University\nof Arizona. https://www.arizona.edu/students\n•\n\nStudent Engagement & Career Development: resources including Handshake for internships and oncampus jobs, career exploration, resume and cover letter assistance, career fairs, workshops and\nseminars, industry Info Sessions, and other resources.\n\n•\n\nHealth and well-being (CAPS): resources and tools including self-care hub, pathways to wellness,\nTogetherall, and short-term counseling and psychiatry services.\n\n•\n\nDisability-related support (DRC): ensures disability access for our campus.\n\n•\n\nSALT Center: fee-based academic support program that inspires students with mild to moderate\nlearning and attention challenges to succeed in higher education through support services.\n\n•\n\nSafety: Link to sign-up for campus emergency alerts: https://cirt.arizona.edu/ualert\n\n•\n\nSIE Departmental Events: check your UA emails and SIE Discord for upcoming events to engage in!\n\nStudent Support Groups and Organizations\n•\n\nCollege of Engineering Study Groups and Tau Beta Pi tutoring\n\n•\n\nThink Tank: offers drop-in tutoring, academic skills workshops, and supplemental instruction\n\n•\n\nStudent Clubs and Professional Societies: get involved with special interest clubs and career-oriented\nor professional groups\n\n•\n\nEngineering Clubs and Organizations: provides opportunities for interests, camaraderie, leadership\nand practical skills\n\n•\n\nSIE-specific organizations: foster teamwork and leadership and strengthen career networks\n\n•\n\nCultural and Resource Centers: spaces on campus that highlight students’ various identities and serve\nas a home-away-from-home. Some centers also provide free CAPS embedded counselors and drop-in\ntutoring for certain courses.\n\n•\n\nInternational Student Services (ISS): assists with I-20 requests, travel documents, employment,\nverification enrollment and concurrent enrollment requests through MyGlobal and sponsored student\nadvising. The Buddy Program also connects students to other international students and Global\nAmbassadors to make friends and explore campus together. ISS now offers an embedded CAPS\ncounselor.\n\n8\n\n\f8. Scholarships\nScholarship Universe is the university scholarship matching tool. Your profile must be updated and answer\nquestions to connect with internal and external scholarships. The College of Engineering General\nScholarship Application usually opens in February, requires full-time enrollment, minimum 3.0 GPA, and\nmeet donor specifications to match with eligible scholarships.\n•\n\nUArizona Merit Scholarships (Tuition Awards): must be able to maintain required units and GPA to\nrenew scholarship for specific award every year.\n\n•\n\nArizona Community Foundation Scholarships are awarded annually to help students achieve their\neducation goals, based on their eligibility.\n\n•\n\nWomen in Science & Engineering (WISE) Scholarships annually administers three scholarship\ncompetitions, normally due end of February.\n\n•\n\nHispanic Association of Colleges and Universities (HACU) Scholarship Program: can apply if\napplicants meet scholarship program criteria.\n\n9"
  },
  "doc-2c3bae1abe4e9618baf11a0c91f2149f": {
    "content": "B.S. in Software Engineering\nCatalog Year 2024-25\n\nBelow is the advised sequence of courses for this degree program on Main Campus as of 10/16/2023.\nOfficial degree requirements and course prerequisites are in the University General Catalog; prerequisites are subject to change.\n\nCourse Number and Title\n\nUnits\n\nPrerequisites/Enrollment Requirements\n\nMATH 122A/B or MATH 125 Calculus I with Applications\n\n5/3\n\nAppropriate Math Placement\n\n*CHEM 151 Chemical Thinking I or CHEM 161/163\n\n4\n\nAppropriate Math Placement\n\nENGL 101 or 107 or 109H First-Year Composition\n\n3\n\nENGR102A/B Introduction to Engineering or ENGR 102\n\n3\n\n1st Semester\n\nUNIV 101 Intro to the General Education Experience\nSemester Total\n\nENGR102A: MATH 112 ENGR102B: Pre- or\nCo-requisite of MATH 112 or higher; FirstYear Status; College of Engineering Major\n\n1\n14/16\n\n2nd Semester\nMATH 129 Calculus II\n\n3\n\nMATH 122B or 125 with C or higher\n\nSFWE 101 Introduction to Software Engineering\n\n3\n\nMATH 112 or higher with C or better\n\nECE 101 Programming I or ECE 175 Computer Programming for\nEngineering Applications\n\n3/4\n\nECE 101: Math 112; ECE175: Concurrent\nEnrollment or completion of MATH 122B or 125\n\nENGL 102 or 108 First-Year Composition\n\n3\n\nENGL 101 or ENGL 107\n\n*CHEM 152 Chemical Thinking II or CHEM 162/164 or MSE 110\nSolid State Chemistry or MCB 181R/L Intro Biology I\n\n4\n\nCHEM 152 and MSE 110: CHEM 151 or 141/143\nor 161/163; MCB181R/L: Appropriate Math\nPlacement level\n\nSemester Total\n\n16/17\n\nrd\n\n3 Semester\nMATH 243 Discrete Mathematics in Computer Science\n\n3\n\n*PHYS 141 Introductory Mechanics or PHYS 161H\n\n4\n\nECE 201 Programming II or ECE 275 Computer Programming for\nEngineering Applications II\n\n3\n\nGeneral Education: Exploring Perspectives (Artist)\n\n3\n\nGeneral Education: Exploring Perspectives (Humanist)\nSemester Total\n\n3\n16\n\nMATH 122B or 125 or 129 (transfer credit ok)\nMATH 122B or 125 or Appropriate Math\nPlacement Level\nECE 201: Pre – MATH 112; ECE 101 with C or\nhigher; ECE 275: Major ECE or SFE. ECE 175\nor CSE 101\n\n4th Semester\nSIE 277 Object-Oriented Modeling and Design\n\n3\n\nECE 274A Digital Logic\n\n4\n\nSFWE 201 Software Engineering Sophomore Colloquium\n\n1\n\nPHYS 241 Introductory Electricity and Magnetism or PHYS 261H\n\n4\n\nECE 175 or CSC 110\nECE 175; Concurrent Enrollment or completion\nof MATH 129\nSFWE 101 or ECE 175\nPHYS 241 or 261H: PHYS 141 or 140 or 161H;\nMATH 129 or Appropriate Math Placement\nLevel\nAppropriate Math Placement Level\n\nMATH/STAT Elective - Consult with faculty advisor\n3\nSemester Total\n15\n*Each of the following foundational science courses satisfies the requirements for General Education: Exploring Perspectives\n(Natural Scientist): CHEM 151 or 152 or 161 or 162; or PHYS 141 or 161H.\n\n\fAdvanced Standing is required for 300- and 400-level engineering courses (see your academic advisor for details).\nCourse Number and Title\n\nUnits\n\nComments\n\n5th Semester\nSIE 305 Introduction to Engineering Probability and Statistics\n\n3\n\nSFWE 301 Software Requirements Analysis and Test (Fall Only)\n\n3\n\nCSC 355 Discrete Structures and Basic Algorithms or\nCSC 345 Analysis of Discrete Structure\nCSC 252 Computer Organization or\nECE 369A Fundamentals of Computer Organization (Fall Only)\nGeneral Education: Exploring Perspectives (Social Scientist)\nSemester Total\n\n3\n3/4\n3\n15/16\n\nth\n\n6 Semester\nSFWE 302 or 405 Software Architecture and Design (Spring Only)\n\n3\n\nSFWE 401 Software Assurance and Security (Spring Only)\n\n3\n\nECE 311 Engineering Ethics and Contemporary Issues\n\n1\n\nTechnical Elective\n\n3\n\nConsult with faculty advisor\n\nTechnical Elective\n\n3\n\nConsult with faculty advisor\n\n†\n\n3\n\nGeneral Education: Building Connections\nSemester Total\n\n16\n\nth\n\n7 Semester\nSFWE 403 Software Project Management (Fall Only)\n\n3\n\nENGR 498A Interdisciplinary Capstone\n\n3\n\nSenior Status\n\nTechnical Elective\n\n3\n\nConsult with faculty advisor\n\nTechnical Elective\n\n3\n\nConsult with faculty advisor\n\n†\n\n3\n\nGeneral Education: Building Connections\nSemester Total\n\n15\n\nth\n\n8 Semester\nSFWE 402 DevOps (Spring Only)\n\n4\n\nTechnical Elective\n\n1-3\n\nSFWE 491 Software Preceptor\n\n1\n\nENGR 498B Interdisciplinary Capstone\n\n3\n\n†\n\nGeneral Education: Building Connections\n\n3\n\nUNIV 301 General Education Portfolio\n\n1\n\nConsult faculty advisor for course approval\n\nSenior Status\n\nSemester Total\n13/15\nStudents should work closely with their academic advisor to select General Education: Building Connections courses; some course\nwork in the major, such as some Technical Elective courses, may also fulfill General Education: Building Connections requirements.\n†"
  },
  "doc-2dc050cb7a59b19fafa3278e81ac851c": {
    "content": "SFEPHD - Software Engineering\nOverview\nProgram Type\nDoctor of Philosophy\nCollege\n\nCareer\n\nCollege of Engineering\n\nGraduate\n\nTotal Units\n63\nProgram Description\nThe Software Engineering PhD program has a firm engineering foundation that encompasses discovery-based education utilizing an experiential learning\napproach. As part of the curriculum, students will complete projects in areas that emphasize software engineering, communication, teamwork, critical\nthinking, and engineering professionalism. Which focuses on the application of a systematic, disciplined, quantifiable approach to the development,\noperation, and maintenance of software. In the PhD program, students will also conduct novel research in many diverse software engineering related areas.\nThe program's flexibility allows students to design their course of study / research from a diverse pool of courses and research opportunities in software\nand computer engineering domains such as web and mobile applications, embedded systems, cybersecurity, machine learning, systems, and other\ninterdisciplinary areas.\n\nProgram Requirements\nSimple Requisites\nProgram Requirements\nMinimum Credit Units\nType\nCompletion Requirement\nAdditional Comments:\n63\n\nCore Coursework Requirements\nType\nCompletion Requirement\nAdditional Comments:\nSFWE 513 (3) – Software Engineering Research Methods\nSFWE 507 (3) – Foundations of Software Engineering\nComplete 9 units of additional core coursework:\nSFWE 502 (3) - Software DevSecOps\nSFWE 503 (3) - Software Project Management\nSFWE 504 (3) - Software Requirements Analysis and Test\nSFWE 505 (3) - Software Architecture and Design\nSFWE 506 (3) - Distributed Computing\nStudents that have a BS in Software Engineering and have demonstrated a given Core course’s competencies must consult/work with their faculty\nadvisor to substitute the course with one of the SFWE 5xx level courses listed below.\n• Choose 16 units non-dissertation course work which must be approved by the faculty advisor and the Director of Graduate Studies:\no Any SFWE core courses not used to meet the Core coursework requirement can also be used as technical electives\no SFWE 501 (3) - SW Assurance\no SFWE 508 (3) –Data Mining\no SFWE 509 (3) – Cloud Computing Principles and Practices\no SFWE 510 (3) – Cloud Native Software Engineering\no SFWE 511 (3) – Software for Industrial Control Systems\n\n\fo SFWE 512 (3) –Robotics\no SFWE 513 (3) – Software Engineering Research Methods\no CSE 501 (3) – Operating Systems\no ECE 503 (3) - Probability and Random Processes for Engineering Applications\no ECE 509 (3) –Cybersecurity Concept, Theory, Practice\no ECE 513 (3) –Web Development and the IoT\no ECE 523 (3) –Engineering Applications of Machine Learning and Data Analytics\no ECE 562 (3) –Computer Architecture and Design\no ECE 576A (3) - Engineering of Computer Based Systems\no ECE 576B (3) - Embedded System Design and Optimization\no ECE 579 (3) –Principles of Artificial Intelligence\no SIE 533 (3) –Fundamentals of Data Science for Engineers\no SIE 558 (3) –Model Based Systems Engineering\no SIE 577 (3) – Introduction to Biomedical Informatics\nColloquium and Dissertation Research (20 units)\n• SFWE 695A - Colloquium (2)\n• SFWE 920 - Dissertation Research (18)\n\nElective Coursework\nType\nCompletion Requirement\nAdditional Comments:\nNone\n\nAdditional Requirements\nType\nCompletion Requirement\nAdditional Comments:\nSpecific requirements will be included in the SFWE Graduate Handbook.\nDoctoral Qualifying Exam (DQE)\nThe purpose of the Doctoral Qualifying Examination (DQE) is to assess students’ fundamental knowledge in specific SFWE domains and whether\nstudents have an integrated understanding in those domains as well as their readiness of a student to undertake advanced graduate work.\nDoctoral Comprehensive Exam\nThe purpose of the DQE is to determine whether the student has developed sufficient background and expertise for research in the field of their\nplanned dissertation. Successful completion of the examination leads to formal admission to PhD candidacy.\nDoctoral Final Written Dissertation\nThe candidate should develop a written document that demonstrates all aspects of their research including significance of the work, a detailed review\nof relevant literature, methodologies employed and/or developed, significant findings from the work, a critical discussion of the findings, limitations,\nand the impact, and potential for future research. Note: The faculty advisor defines the specific format of the written dissertation. The Graduate\nCollege provides general formatting guidelines: https://grad.arizona.edu/gsas/dissertationstheses/dissertation-and-thesisformatting-guides\nFinal Oral Defense\nWhen the doctoral candidate has met the rigor and standards of scholarship and has documented the research in a dissertation, the candidate will\npublicly defend the dissertation and answer any general questions related to their work. The exact time and place of the oral defense must be\nannounced publicly at least two weeks in advance of the oral defense. The oral defense is facilitated by a faculty committee appointed by the Dean of\n\n\fthe Graduate College in consultation with the major department and chaired by the faculty advisor. The presentation portion of the oral defense is\nopen to the public. Following the public presentation and discussion, the candidate will participate in a closed meeting with the committee for further\nevaluation\n\nMinor Requirements for Doctoral Students in this Program\nType\nCompletion Requirement\nAdditional Comments:\nAll minor coursework (12 units) can come from a single discipline or split between two disciplines (6 units from each discipline).\n\nStudent Handbook\nType\nCompletion Requirement\nAdditional Comments:\n\nSubplan\nNo Requirement Level"
  }
}